app/controllers/emails_controller.rb

SELECT "emails".* FROM "emails"
---
    def index
      @emails = Email.all

INSERT INTO "emails" ("object", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["object", "doyle_dare@klocko.org"], ["body", "The Killing Joke"], ["created_at", "2020-05-28 12:33:30.153659"], ["updated_at", "2020-05-28 12:33:30.153659"]]
---
    def create
      @email = Email.create!(object:  Faker::DcComics.title,
      body: Faker::Lorem.sentence(word_count: 10))

SELECT  "emails".* FROM "emails" WHERE "emails"."id" = $1 LIMIT $2  [["id", 237], ["LIMIT", 1]]
UPDATE "emails" SET "read" = $1, "updated_at" = $2 WHERE "emails"."id" = $3  [["read", true], ["updated_at", "2020-05-28 19:35:20.429780"], ["id", 338]]
---
    def show

      @email = Email.find(params[:id])
      @email.update!(read: true)

SELECT  "emails".* FROM "emails" WHERE "emails"."id" = $1 LIMIT $2  [["id", 337], ["LIMIT", 1]]
DELETE FROM "emails" WHERE "emails"."id" = $1  [["id", 337]]
---
    def destroy
      @email = Email.find(params[:id])
      @email.destroy

SELECT  "emails".* FROM "emails" WHERE "emails"."id" = $1 LIMIT $2  [["id", 333], ["LIMIT", 1]]
UPDATE "emails" SET "read" = $1, "updated_at" = $2 WHERE "emails"."id" = $3  [["read", true], ["updated_at", "2020-05-28 19:34:03.427660"], ["id", 333]]
---
    def update
      @email = Email.find(params[:id])
      @email.update!(read: !@email.read)