app/views/emails/create.js.erb

document.getElementById('email_list').insertAdjacentHTML("beforeend", "<%= j render 'email', email: @email %>")
---
INSERT INTO "emails" ("object", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["object", "Multiversity"], ["body", "Et a facilis alias rem assumenda molestiae ipsam impedit sed."], ["created_at", "2020-05-28 13:00:05.411100"], ["updated_at", "2020-05-28 13:00:05.411100"]]